app/controllers/students_controller.rb

    def create
        @student = Student.new(post_params)
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Kevin"], ["last_name", "Botero"], ["created_at", "2020-11-18 18:22:16.099508"], ["updated_at", "2020-11-18 18:22:16.099508"]]

    def update
        @student= Student.find(params[:id])
        @student.update(post_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "bobby"], ["updated_at", "2020-11-18 18:25:36.598920"], ["id", 3]]